# цикл for это просто перебор, в то врем€ как while - это цикл с условием
# c:\TEMPO\1. Ruby on Rails c нул€ (2015) [Ѕазовый]\«ан€тие 02. ќсновы Ruby. „асть 2\«ан€тие 02. ќсновы Ruby. „асть 2\
#  00:48:00

range = (1..5)
for index in range   # index произвольное название переменной, котор будет использоватьс€ внутри цикла
      puts index          # поочередно с каждой итерацией цикла в index попадет очередное значение из переменной range 
end


##########################################
index = 0
while index < 5 do
	puts index
	index += 2
end
